var_x = 'NLP'
var_y = var_x.lower()
print(var_y)
 
# Гаралт: nlp

text = ['Аз хамаагүй, миний АЗ аль хэдийн гэр лүүгээ харьсан',
'Микрофоныг өөр лүүгээ чиглүүлээд барьсан',
'Мөчөөс хойш Элсэн цагийг ЭРГҮҮЛЭЭД тавьсан']

# жагсаалтыг датафрейм рүү хувиргах
import pandas as pd
df = pd.DataFrame({'lyric':text})
print(df)
 
# Гаралт: 
#                                               lyric
# 0  Аз хамаагүй, миний АЗ аль хэдийн гэр лүүгээ ха...
# 1           Микрофоныг өөр лүүгээ чиглүүлээд барьсан
# 2         Мөчөөс хойш Элсэн цагийг ЭРГҮҮЛЭЭД тавьсан

df['lyric'] = df['lyric'].apply(lambda x: " ".join(x.lower() for x in x.split()))
print(df['lyric'])
# Гаралт: 
# 0    аз хамаагүй, миний аз аль хэдийн гэр лүүгээ ха...
# 1             микрофоныг өөр лүүгээ чиглүүлээд барьсан
# 2           мөчөөс хойш элсэн цагийг эргүүлээд тавьсан
# Name: lyric, dtype: object
