import re

var_x = "Тамирчин. байсан, бол би (алтын) төлөө!"
# цэг, таслал болон бусад тэмдэгтийг устгах
var_y = re.sub(r'[^\w\s]', '', var_x)

print(var_y)
# Гаралт: Тамирчин байсан бол би алтын төлөө




import string

var_x = "Тамирчин. байсан, бол би (алтын) төлөө!"
for s in string.punctuation:
    var_x = var_x.replace(s, "")
print(var_x)
# Гаралт: Тамирчин байсан бол би алтын төлөө





text = ['Аз хамаагүй, миний аз! аль хэдийн гэр лүүгээ (харьсан)',
'Микрофоныг [өөр] лүүгээ чиглүүлээд барьсан',
'Мөчөөс хойш элсэн? цагийг эргүүлээд,, тавьсан']

# жагсаалтыг датафрейм рүү хувиргах
import pandas as pd
df = pd.DataFrame({'lyric':text})

# regex болон replace() функц ашиглах
df['lyric'] = df['lyric'].str.replace('[^\w\s]', '', regex=True)

print(df['lyric'])

# Гаралт: 
# 0    Аз хамаагүй миний аз аль хэдийн гэр лүүгээ хар...
# 1             Микрофоныг өөр лүүгээ чиглүүлээд барьсан
# 2           Мөчөөс хойш элсэн цагийг эргүүлээд тавьсан
# Name: lyric, dtype: object
