str_lyric = "өрөөдлөө бүтэн биелэгдтэл нь сайн гүй Үүний төлөө бидэнд дий*эх ёстой дайн бий"

# Тэмдэгт мөрөөс эхний тэмдэгтийг авах
print(str_lyric[0])
# Гаралт: М

# Тэмдэгт мөрөөс 16-аас 26-р индекс хүртэлх хэсгийг тасдан авах
print(str_lyric[16:26])
# Гаралт: биелэгдтэл

# Тэмдэгт мөр доторх алдаатай бичсэн ‘дий*эх’ гэдгийг ‘дийлэх’ болгон солих
str_newlyric = str_lyric.replace("ий*эх", "ийлэх")
print(str_newlyric)
# Гаралт: Мөрөөдлөө бүтэн биелэгдтэл нь сайн гүй Үүний төлөө бидэнд дийлэх ёстой дайн бий

s1 = "үлхэж өгөхгүй юм бол"
s2 = "одол өөрөө биелэгдэнэ гэж үгүй"
s3 = s1 + s2
print(s3)
# Гаралт: Түлхэж өгөхгүй юм болбодол өөрөө биелэгдэнэ гэж үгүй

s3 = s1 + "" + s2
print(s3)
# Гаралт: Түлхэж өгөхгүй юм бол бодол өөрөө биелэгдэнэ гэж үгүй

s1 = "үлхэж өгөхгүй юм"
s2 = "одол өөрөө биелэгдэнэ гэж үгүй"

# f-string ашиглан тэмдэгт мөр залгах
s3 = f"{s1} бол {s2}"
print(s3)
# Түлхэж өгөхгүй юм бол бодол өөрөө биелэгдэнэ гэж үгүй

lyric = "нэ бол миний хатуу төлөв, юу ч намайг дийлэхгүй Чиглэж ирсэн хатуу чулуу бут үсрэн үйрэх вий"
wordToFind = "атуу"

# ‘хатуу’ үгийг эхнээс нь хайх
i = lyric.find(wordToFind)
print(i)
# Гаралт: 14

# Олдсон 14 дэх индексээс хойших 11 тэмдэгтийг тасдаж авах
print(lyric[i:i+11])
# Гаралт: хатуу төлөв

# ‘хатуу’ үгийг сүүлээс нь хайх
j = lyric.rfind(wordToFind)
print(j)
# Гаралт: 62

# Олдсон 62 дэх индексээс хойших 11 тэмдэгтийг гаргах
print(lyric[j:j+11])
# Гаралт: хатуу чулуу
